Repository: Paulo-Massao1/ship-rate-project
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Password
pt: Senha

source: Yes
pt: Sim

source: No
pt: Não

source: Cancel
pt: Cancelar

source: Ratings
pt: Avaliações

source: Cabin
pt: Cabine

source: Bridge
pt: Passadiço

source: Pilot
pt: Prático

# loginSubtitle
source: Enter your email and password to continue
pt: Entre com seu e-mail e senha para continuar

# loginButton
source: Log in
pt: Entrar

# loginSuccess
source: Login successful
pt: Login realizado com sucesso

# forgotPassword
source: Forgot my password
pt: Esqueci minha senha

# createAccount
source: Create new account
pt: Criar nova conta

# createAccountTitle
source: Create account
pt: Criar conta

# registerSubtitle
source: Fill in the details to continue
pt: Preencha os dados para continuar

source: Call sign
pt: Nome de guerra

source: Confirm password
pt: Confirmar senha

# registerButton
source: Register
pt: Cadastrar

# registerSuccess
source: Registration successful
pt: Cadastro realizado com sucesso

# alreadyHaveAccount
source: I already have an account
pt: Já tenho uma conta

source: Recover password
pt: Recuperar senha

# recoverPasswordSubtitle
source: Enter your email to receive the reset link
pt: Informe seu e-mail para receber o link de redefinição

source: Send link
pt: Enviar link

# resetEmailSent
source: We sent a recovery link to your email.
pt: Enviamos um link de recuperação para o seu e-mail.

# spamNotice
source: If you can't find the email, also check your SPAM or Junk folder.
pt: Caso não encontre o e-mail, verifique também sua caixa de SPAM ou Lixo Eletrônico.

source: Back to login
pt: Voltar para o login

# appSubtitle
source: Professional ship evaluation
pt: Avaliação profissional de navios

# drawerSearchRate
source: Search / Rate Ships
pt: Buscar / Avaliar Navios

# drawerMyRatings
source: My Ratings
pt: Minhas Avaliações

# drawerSendSuggestion
source: Send Suggestion
pt: Enviar Sugestão

# drawerShareApp
source: Share App
pt: Compartilhar App

# drawerLogout
source: Log out
pt: Sair

# linkCopied
source: Link copied to clipboard!
pt: Link copiado para a área de transferência!

source: Update Available
pt: Atualização Disponível

source: Share ShipRate
pt: Compartilhar ShipRate

source: Copy Link
pt: Copiar Link

# shareText
source: Check out ShipRate! The professional ship evaluation app for pilots. Visit: https://shiprate-daf18.web.app/
pt: Conheça o ShipRate! O app de avaliação profissional de navios para práticos. Acesse: https://shiprate-daf18.web.app/

# shipRatingTitle
source: Ship Rating
pt: Avaliação de Navios

# searchSubtitle
source: Search ratings or register your experience
pt: Pesquise avaliações ou registre sua experiência

# searchTab
source: Search
pt: Buscar

# rateTab
source: Rate
pt: Avaliar

# searchHint
source: Search by ship name or IMO
pt: Buscar por nome do navio ou IMO

source: New Ship Rating
pt: Nova Avaliação de Navio

# rateSubtitle
source: Register your technical evaluation quickly and safely
pt: Registre sua avaliação técnica de forma rápida e segura

source: Start rating
pt: Iniciar avaliação

# generalInfo
source: General Information
pt: Informações Gerais

source: Rating Averages
pt: Médias das Avaliações

# viewOnMarineTraffic
source: View Details on MarineTraffic
pt: Ver Detalhes no MarineTraffic

# marineTrafficError
source: Could not open MarineTraffic
pt: Não foi possível abrir MarineTraffic

source: Crew
pt: Tripulação

source: Cabins
pt: Cabines

source: Minibar
pt: Frigobar

source: Sink
pt: Pia

source: Microwave
pt: Micro-ondas

# avgCabinTemp
source: Cabin Temp.
pt: Temp. Cabine

# avgCabinCleanliness
source: Cabin Cleanliness
pt: Limpeza Cabine

# avgBridgeEquipment
source: Bridge Equip.
pt: Equip. Passadiço

# avgBridgeTemp
source: Bridge Temp.
pt: Temp. Passadiço

# avgFood
source: Food
pt: Alimentação

# avgRelationship
source: Relationship
pt: Relacionamento

# avgDevice
source: Device
pt: Dispositivo

source: Pilot: {callSign}
pt: Prático: {callSign}

source: View rating
pt: Visualizar avaliação

# rateShipTitle
source: Rate Ship
pt: Avaliar Navio

source: Save Rating
pt: Salvar Avaliação

source: Ship Data
pt: Dados do Navio

source: Ship name
pt: Nome do navio

# enterShipName
source: Enter the ship name
pt: Informe o nome do navio

source: IMO (optional)
pt: IMO (opcional)

source: Disembarkation date
pt: Data de desembarque

source: Tap to select
pt: Toque para selecionar

source: Crew nationality
pt: Nacionalidade da tripulação

# cabinCount
source: Number of cabins
pt: Quantidade de cabines

source: Cabin type
pt: Tipo da cabine

source: Cabin deck
pt: Deck da cabine

source: Has minibar
pt: Possui frigobar

source: Has sink
pt: Possui pia

source: Has microwave
pt: Possui micro-ondas

source: Other Ratings
pt: Outras Avaliações

source: General Observation
pt: Observação Geral

# generalObservationHint
source: Additional comments about the overall experience on the ship...
pt: Comentários adicionais sobre a experiência geral no navio...

source: Observations (optional)
pt: Observações (opcional)

# fillRequiredFields
source: Fill in all required fields
pt: Preencha todos os campos obrigatórios

# editRatingTitle
source: Edit Rating
pt: Editar Avaliação

source: Save Changes
pt: Salvar Alterações

# editWarningBanner
source: Edit only typos. For ship changes, create a new rating.
pt: Edite apenas erros de digitação. Para mudanças no navio, crie nova avaliação.

# ratingUpdatedSuccess
source: Rating updated successfully!
pt: Avaliação atualizada com sucesso!

# errorLoadingData
source: Error loading data: {error}
pt: Erro ao carregar dados: {error}

# errorSaving
source: Error saving: {error}
pt: Erro ao salvar: {error}

# shipNameRequired
source: Ship name *
pt: Nome do navio *

# disembarkationDateRequired
source: Disembarkation date *
pt: Data de desembarque *

# cabinTypeRequired
source: Cabin type *
pt: Tipo da cabine *

# myRatingsTitle
source: My Ratings
pt: Minhas Avaliações

# loadingRatings
source: Loading your ratings...
pt: Carregando suas avaliações...

source: Try Again
pt: Tentar Novamente

source: No ratings yet
pt: Nenhuma avaliação ainda

# noRatingsSubtitle
source: You haven't rated any ships yet. Start rating your next voyage!
pt: Você ainda não avaliou nenhum navio. Comece avaliando sua próxima viagem!

# totalRatings
source: {count, plural, =1{Total: 1 rating} other{Total: {count} ratings}}
pt: {count, plural, =1{Total: 1 avaliação} other{Total: {count} avaliações}}

source: Newest first
pt: Mais recentes primeiro

source: Average Score
pt: Nota Média

source: Rating Date
pt: Data de Avaliação

# deleteLabel
source: Delete
pt: Excluir

# editLabel
source: Edit
pt: Editar

# ratingDeletedSuccess
source: Rating deleted successfully!
pt: Avaliação excluída com sucesso!

# errorDeleting
source: Error deleting: {error}
pt: Erro ao excluir: {error}

# pdfGeneratedSuccess
source: PDF generated successfully!
pt: PDF gerado com sucesso!

# errorGeneratingPdf
source: Error generating PDF: {error}
pt: Erro ao gerar PDF: {error}

# editWarningTitle
source: Warning
pt: Atenção

# editWarningCorrectionsOnly
source: Edit only to correct errors
pt: Edite apenas para corrigir erros

# editWarningDescription
source: This feature is for correcting typos or incorrect information.
pt: Esta função serve para corrigir erros de digitação ou informações incorretas.

# editWarningImportant
source: Important: Use only for corrections, not to update ship changes over time.
pt: Importante: Use apenas para correções, não para atualizar mudanças no navio ao longo do tempo.

# editWarningNewRating
source: If the ship's condition has changed since your last rating, create a NEW rating instead of editing this one.
pt: Se o navio mudou de condição desde sua última avaliação, crie uma NOVA avaliação em vez de editar esta.

# editWarningHistory
source: Keeping history helps other pilots!
pt: Manter histórico ajuda outros práticos!

# editWarningConfirm
source: I understand, I want to edit
pt: Entendi, quero editar

# deleteRatingTitle
source: Delete Rating
pt: Excluir Avaliação

# deleteRatingConfirm
source: Are you sure you want to delete the rating for ship "{shipName}"?
pt: Tem certeza que deseja excluir a avaliação do navio "{shipName}"?

# deleteWarning
source: This action cannot be undone!
pt: Esta ação não pode ser desfeita!

# deleteButton
source: Delete
pt: Excluir

# ratingDetailTitle
source: Rating Details
pt: Detalhes da Avaliação

source: Export PDF
pt: Exportar PDF

source: Error loading ship data
pt: Erro ao carregar dados do navio

# defaultShipName
source: Ship
pt: Navio

# ratedOn
source: Rated on: {date}
pt: Avaliado em: {date}

# disembarkationDateValue
source: Disembarkation date: {date}
pt: Data de desembarque: {date}

# cabinTypeValue
source: Cabin type: {type}
pt: Tipo da cabine: {type}

# shipInfo
source: Ship Information
pt: Informações do Navio

source: General Observations
pt: Observações Gerais

# cabinSection
source: Cabin
pt: Cabine

# bridgeSection
source: Bridge
pt: Passadiço

# otherSection
source: Other
pt: Outros

# scoreLabel
source: Score: {score}
pt: Nota: {score}

source: Anonymous
pt: Anônimo

# criteriaCabinTemp
source: Cabin Temperature
pt: Temperatura da Cabine

# criteriaCabinCleanliness
source: Cabin Cleanliness
pt: Limpeza da Cabine

# criteriaBridgeEquipment
source: Bridge – Equipment
pt: Passadiço – Equipamentos

# criteriaBridgeTemp
source: Bridge – Temperature
pt: Passadiço – Temperatura

# criteriaDevice
source: Boarding/Disembarking Device
pt: Dispositivo de Embarque/Desembarque

# criteriaFood
source: Food
pt: Comida

# criteriaRelationship
source: Relationship with captain/crew
pt: Relacionamento com comandante/tripulação

# sendSuggestionTitle
source: Send Suggestion
pt: Enviar Sugestão

source: Your opinion matters
pt: Sua opinião é importante

# helpImproveApp
source: Help improve ShipRate with suggestions and ideas.
pt: Ajude a melhorar o ShipRate com sugestões e ideias.

# suggestionType
source: Suggestion
pt: Sugestão

# complaintType
source: Complaint
pt: Crítica

# complimentType
source: Compliment
pt: Elogio

# messageLabel
source: Message
pt: Mensagem

# sendButton
source: Send
pt: Enviar

# messageSentSuccess
source: Message sent successfully!
pt: Mensagem enviada com sucesso!

source: Error sending message.
pt: Erro ao enviar mensagem.

# totalShipsLabel
source: Ships
pt: Navios

# totalRatingsLabel
source: Ratings
pt: Avaliações

# yourRatingsLabel
source: Your Ratings
pt: Suas Avaliações

source: Your Contribution
pt: Sua Contribuição

# contributionProgress
source: {percent}% of ratings
pt: {percent}% das avaliações

source: Recent Activity
pt: Atividade Recente

source: No recent activity
pt: Nenhuma atividade recente

# pdfReportTitle
source: Ship Rating Report
pt: Relatório de Avaliação de Navio

# pdfEvaluationInfo
source: Evaluation Information
pt: Informações da Avaliação

# pdfEvaluator
source: Evaluator Pilot
pt: Prático Avaliador

# pdfEvaluationDate
source: Evaluation Date
pt: Data da Avaliação

# pdfCabinType
source: Cabin Type
pt: Tipo de Cabine

# pdfDisembarkationDate
source: Disembarkation Date
pt: Data de Desembarque

# pdfOverallAverage
source: Overall Average Score
pt: Nota Média Geral

# pdfCrewNationality
source: Crew Nationality
pt: Nacionalidade da Tripulação

# pdfCabinCount
source: Number of Cabins
pt: Quantidade de Cabines

# pdfRatingsByCriteria
source: Ratings by Criteria
pt: Avaliações por Critério

# pdfGeneralObservation
source: General Observation
pt: Observação Geral

# pdfGeneratedBy
source: Generated by ShipRate
pt: Gerado por ShipRate

# pdfDateLabel
source: Date
pt: Data
